//---------------------------------------------------------------------------
#include "stdio.h"
#include "DoseConfig.h"
//---------------------------------------------------------------------------
TDoseConfig::TDoseConfig()  //DoseConfig中的数据，原来是dosecomp.cfg文件中的内容，以前是要读文
{                           //件得到，现在先写固定，以后再通过“设置”中的系统设置来由用户输入得到
  lenx = 0.2,leny = 0.2;lenz = 0.2;
  lenx0 = 0.2,leny0 = 0.2,lenz0 = 0.2;
  lenmx = 0.05,lenmy = 0.05,lenmz = 0.05;
  RCUT = 1.0;
  NSEL = 99999999;
}
